blog/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    "test   from main"
    "commit 2"
    @posts = Post.all